<a href="https://colab.research.google.com/github/plumwiserim/Data-Analysis/blob/main/Class4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas 시작하기

In [ ]:
import pandas as pd

In [ ]:
print(pd.__version__)

1.1.5

## 자료구조 Series

### Series 의 생성(1)

In [ ]:
# 리스트 데이터로 Series 객체 생성하기

year = ['2019', '2020', '2021', '2022']
result = pd.Series(data=year)

print('\nType:', type(result))
print(result)

Type: <class 'pandas.core.series.Series'>
0    2019
1    2020
2    2021
3    2022
dtype: object

In [ ]:
# Series 객체의 주요 속성
print('Index: ', result.index )
print('Data: ', result.values )
print('DType: ', result.dtype )
print('Shape: ', result.shape )

Index:  RangeIndex(start=0, stop=4, step=1)
Data:  ['2019' '2020' '2021' '2022']
DType:  object
Shape:  (4,)

In [ ]:
# Series 객체의 이름 지정
result.name = 'Year'
result.index.name = 'No.'
print(result)

No.
0    2019
1    2020
2    2021
3    2022
Name: Year, dtype: object

### Series 의 생성(2)

In [ ]:
# 인덱스 추가하여 Series 객체 생성하기
year = ['2019', '2020', '2021', '2022']
idx = ['a', 'b', 'c', 'd']

result = pd.Series(data=year, index=idx, name='Year')
print(result)

a    2019
b    2020
c    2021
d    2022
Name: Year, dtype: object

### Series 의 생성(3)

In [ ]:
# 딕셔너리 데이터로 Series 객체 생성하기
score = {'Kim':85, 'Han':89, 'Lee':99, 'Choi':70}

result = pd.Series(data=score, name='Score')
print(result)

Kim     85
Han     89
Lee     99
Choi    70
Name: Score, dtype: int64

## 자료구조 DataFrame

### DataFrame 의 생성(1)

In [ ]:
# 파이썬 딕셔너리 객체 이용하여 DataFrame 생성하기
score = {'name': ['Jessi', 'Emma', 'Alex', 'Tom'],
         'score': [100, 95, 80, 85],
         'grade': ['A', 'A', 'B', 'B']}
        
df = pd.DataFrame(data=score)
print(type(df))
print(df)

In [ ]:
# DataFrame 주요 속성 실습-1
print('-Index: ', df.index)
print('-Columns: ', df.columns)
print('-Values:', df.values)

In [ ]:
# DataFrame 주요 속성 실습-2
print('-DTypes: ', df.dtypes)
print('-Shape: ', df.shape)

### DataFrame 의 생성(2)

In [ ]:
# index, columns 지정하여 DataFrame 생성하기
score = {'name': ['Jessi', 'Emma', 'Alex', 'Tom'],
         'score': [100, 95, 80, 85],
         'grade': ['A', 'A', 'B', 'B']}     
i = ['a', 'b', 'c', 'd']
c = ['score', 'grade', 'name', 'email']
        
df = pd.DataFrame(data=score, index=i, columns=c)
print(df)

   score grade   name email
a    100     A  Jessi   NaN
b     95     A   Emma   NaN
c     80     B   Alex   NaN
d     85     B    Tom   NaN

## DataFrame 살펴보기

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
print(score_df)

    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

* info(), head(), tail(), sample() 실습

In [ ]:
print('\n<Summary of DataFrame>')
print(score_df.info())

<Summary of DataFrame>
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   score    5 non-null      int64
 2   grade    5 non-null      object
 3   subject  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes
None

In [ ]:
print('\n<Return the first n rows>')
print(score_df.head(3))

<Return the first n rows>
    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python

In [ ]:
print('\n<Return the last n rows>')
print(score_df.tail(2))

<Return the last n rows>
    name  score grade subject
3  Jessi     85     B       c
4    Tom     97     A    java

In [ ]:
print('\n<Return a random sample>')
print(score_df.sample())

<Return a random sample>
  name  score grade subject
4  Tom     97     A    java

## 수치형과 범주형 데이터의 이해

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'age': [20, 24, 23, 20, 27],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}

score_df = pd.DataFrame(data=score)
print(score_df)

    name  age  score grade subject
0  Jessi   20    100     A  python
1   Emma   24     95     A    java
2   Alex   23     80     B  python
3  Jessi   20     85     B       c
4    Tom   27     97     A    java

In [ ]:
# describe() 함수 실습
print("Generate Descriptive Statistics")
print(score_df.describe())

Generate Descriptive Statistics
             age       score
count   5.000000    5.000000
mean   22.800000   91.400000
std     2.949576    8.502941
min    20.000000   80.000000
25%    20.000000   85.000000
50%    23.000000   95.000000
75%    24.000000   97.000000
max    27.000000  100.000000

In [ ]:
# 범주형 데이터에 대한 describe() 함수 실습

print("Generate Descriptive Statistics for Categorical")
print(score_df[['grade', 'subject']].describe())

Generate Descriptive Statistics for Categorical
       grade subject
count      5       5
unique     2       3
top        A  python
freq       3       2

In [ ]:
# 범주형 데이터를 위한 unique() 함수 실습
print("The Unique Values")
print(score_df['subject'].unique())

The Unique Values
['python' 'java' 'c']

In [ ]:
# 범주형 데이터를 위한 value_counts() 함수 실습
print("The Value Counts")
print(score_df['subject'].value_counts())

The Value Counts
python    2
java      2
c         1
Name: subject, dtype: int64

## 데이터 조회 및 변경

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
print(df)

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# 인덱싱 기법으로 열 데이터 조회 실습
print('Columns : name')
print(df['name'])

Columns : name
0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [ ]:
# . 연산자로 열 데이터 조회 실습
print('Columns : name')
print(df.name)

Columns : name
0    Jessi
1     Emma
2     Alex
3    Jessi
4      Tom
Name: name, dtype: object

In [ ]:
# df.name 의 타입 출력하여 확인
print('Type:', type(df.name))

In [ ]:
# 다중 열 데이터 조회 실습
print('Columns : name-subject-grade')
print(df[['name', 'subject', 'grade']])

Columns : name-subject-grade
    name subject grade
0  Jessi  python     A
1   Emma    java     A
2   Alex  python     B
3  Jessi       c     B
4    Tom    java     A

In [ ]:
# etc 열 데이터 변경하기
print('Modify Column Data')
_____________________
df

In [ ]:
# loc 이용하여 행 데이터 조회 실습
print('Rows-1')
print(df.loc[1])

Rows-1
name       Emma
subject    java
score        95
grade         A
etc         NaN
Name: 1, dtype: object

In [ ]:
# loc 이용하여 다중 행 데이터 조회 실습
print('Rows-0,2,4')
df.loc[[0,2,4]]

Rows-0,2,4

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
2   Alex  python     80     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# 특정 행 데이터 변경 실습
print('Modify Rows0')
df.loc[0] = ['Jessi', 'java', 70, 'C', 1]
df

Modify Rows0

    name subject  score grade  etc
0  Jessi    java     70     C    1
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# 행과 열의 조건을 동시에 지정하여 조회 실습
row_idx = [1,2,4]
col_idx = ['name', 'subject', 'grade']

print('Rows & Columns')
print(df.loc[row_idx, col_idx])

Rows & Columns
   name subject grade
1  Emma    java     A
2  Alex  python     B
4   Tom    java     A

## 데이터 추가, 삭제

* 실습 데이터 생성

In [ ]:
import pandas as pd

# 실습 데이터 생성
score = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'],
         'score': [100, 95, 80, 85, 97],
         'grade': ['A', 'A', 'B', 'B', 'A'],
         'subject':['python', 'java', 'python', 'c', 'java']}
c = ['name', 'subject', 'score', 'grade', 'etc']

df = pd.DataFrame(data=score, columns=c)
df

    name subject  score grade  etc
0  Jessi  python    100     A  NaN
1   Emma    java     95     A  NaN
2   Alex  python     80     B  NaN
3  Jessi       c     85     B  NaN
4    Tom    java     97     A  NaN

In [ ]:
# Series 객체 생성하여 'semester' 라는 열 추가
semester_data = pd.Series(['20-01', '20-01', '20-02', '20-01'])
df['semester'] = semester_data

print('Add Columns : semester')
df

Add Columns : semester

    name subject  score grade  etc semester
0  Jessi  python    100     A  NaN    20-01
1   Emma    java     95     A  NaN    20-01
2   Alex  python     80     B  NaN    20-02
3  Jessi       c     85     B  NaN    20-01
4    Tom    java     97     A  NaN      NaN

In [ ]:
# 연산 이용하여 'high_score' 라는 열 추가
df['high_score'] = df['score'] > 90

print('Add Columns : high_score')
df

Add Columns : high_score

    name subject  score grade  etc semester  high_score
0  Jessi  python    100     A  NaN    20-01        True
1   Emma    java     95     A  NaN    20-01        True
2   Alex  python     80     B  NaN    20-02       False
3  Jessi       c     85     B  NaN    20-01       False
4    Tom    java     97     A  NaN      NaN        True

In [ ]:
# 6 번 인덱스에 행 데이터 추가
df.loc[6] = ['Jina', 'python', 100, 'A', 1, '20-02', True]

print('Add Row 6')
df

Add Row 6

    name subject  score grade  etc semester  high_score
0  Jessi  python    100     A  NaN    20-01        True
1   Emma    java     95     A  NaN    20-01        True
2   Alex  python     80     B  NaN    20-02       False
3  Jessi       c     85     B  NaN    20-01       False
4    Tom    java     97     A  NaN      NaN        True
6   Jina  python    100     A    1    20-02        True

In [ ]:
# 1) drop() 이용하여 행 데이터 삭제
# 2) inplace 인자를 사용하여 원본 데이터에 바로 삭제
df.drop(6)

print('Delete Row : 6')
df

Delete Row : 6

    name subject  score grade  etc semester  high_score
0  Jessi  python    100     A  NaN    20-01        True
1   Emma    java     95     A  NaN    20-01        True
2   Alex  python     80     B  NaN    20-02       False
3  Jessi       c     85     B  NaN    20-01       False
4    Tom    java     97     A  NaN      NaN        True
6   Jina  python    100     A    1    20-02        True

In [ ]:
# drop() 이용하여 'etc' 열 삭제 (원본데이터변경)
df.drop(columns=['etc'], inplace = True)

print('Delete Column :')
df

Delete Column :

    name subject  score grade semester  high_score
0  Jessi  python    100     A    20-01        True
1   Emma    java     95     A    20-01        True
2   Alex  python     80     B    20-02       False
3  Jessi       c     85     B    20-01       False
4    Tom    java     97     A      NaN        True
6   Jina  python    100     A    20-02        True

## 데이터 파일 읽기

In [ ]:
filepath = '/content/titanic.csv'

titanic_df = pd.read_csv(filepath)
type(titanic_df)

pandas.core.frame.DataFrame

In [ ]:
# info() 확인해보기
print('Summary of DataFrame')
titanic_df.info()

Summary of DataFrame
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# sample 데이터 출력해보기
print('Return the first n rows')
print(titanic_df.head(5))

Return the first n rows
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
# 엑셀 파일에서 데이터 읽기
filepath2 = '/content/students_score.xlsx'
print('Read students_score.xlsx')
sample_df = pd.read_excel(filepath2)
sample_df

Read students_score.xlsx

   Jessi  20  100  A  python
0   Emma  24   95  A    java
1   Alex  23   80  B  python
2  Jessi  20   85  B       c
3    Tom  27   97  A    java
4    Sia  28   79  C  python

In [ ]:
# 1) header=none 옵션으로 컬럼 없이 데이터 읽기
# 2) df.columns 에 새로운 컬럼명 저장하기
sample_df = pd.read_excel(filepath2, header=None)
sample_df.columns = ['name', 'age', 'score', 'grade', 'subject']

print('Read Excel by header=none')
sample_df

Read Excel by header=none

    name  age  score grade subject
0  Jessi   20    100     A  python
1   Emma   24     95     A    java
2   Alex   23     80     B  python
3  Jessi   20     85     B       c
4    Tom   27     97     A    java
5    Sia   28     79     C  python

In [ ]:
# 'students' sheet 에 있는 데이터 읽기
print('Read Excel on students sheet')
student_df = pd.read_excel(filepath2, sheet_name='students')
student_df

Read Excel on students sheet

    name  age  etc1  etc2  etc3                email
0    Lee   25   0.1   0.1   0.1    lee@codepresso.kr
1  Hwang   24   0.1   0.1   0.1  hwang@codepresso.kr
2    Kim   28   0.1   0.1   0.1    kim@codepresso.kr
3   Choi   27   0.1   0.1   0.1   choi@codepresso.kr
4   Park   21   0.1   0.1   0.1   park@codepresso.kr
5    Lim   20   0.1   0.1   0.1    lim@codepresso.kr

## 데이터 전처리(1)

* 샘플데이터 생성

In [ ]:
import pandas as pd
import numpy as np

# 실습 데이터 생성
df = pd.DataFrame(data = np.arange(18).reshape(6,3),
				  index = ['a','b','c','d','e','f'],
                  columns=['col1','col2','col3'])
                  
df['col4'] = pd.Series(data = [1.7, 1.2, 2.4], 
                       index = ['a','e','c'])
df.loc['c'] = None

# 실습 데이터 출력
print(df)

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
c   NaN   NaN   NaN   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

In [ ]:
# df.info() 함수로 결측치 유무 확인하기
print('#1 Summary of DataFrame')
df.info()

#1 Summary of DataFrame
<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    5 non-null      float64
 2   col3    5 non-null      float64
 3   col4    2 non-null      float64
dtypes: float64(4)
memory usage: 400.0+ bytes

In [ ]:
# df.isnull() 함수로 결측치 유무 확인하기
print('#2 isnull of DataFrame')
df.isnull()

#2 isnull of DataFrame

    col1   col2   col3   col4
a  False  False  False  False
b  False  False  False   True
c   True   True   True   True
d  False  False  False   True
e  False  False  False  False
f  False  False  False   True

In [ ]:
print('#4 Sum of all missing values per columns')
df.isnull().sum()

#4 Sum of all missing values per columns

col1    1
col2    1
col3    1
col4    4
dtype: int64

In [ ]:
print('#5 Sum of all missing values per rows')
df.isnull().sum(axis=1)

#5 Sum of all missing values per rows

a    0
b    1
c    4
d    1
e    0
f    1
dtype: int64

## 데이터 전처리(2)

In [ ]:
# 행을 기준으로 결측치 조회하여 제거하기
print('#1 Remove missing values')
df.dropna()

#1 Remove missing values

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
e  12.0  13.0  14.0   1.2

In [ ]:
# 원본데이터에 반영
print('#2 Remove missing values with inpalce=True')
df.dropna(how='all',inplace=True)
df

#2 Remove missing values with inpalce=True

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

In [ ]:
# 열을 기준으로 결측치 조회하여 제거하기
print('#3 Remove missing values in columns')
df.dropna(axis = 'columns')

#3 Remove missing values in columns

   col1  col2  col3
a   0.0   1.0   2.0
b   3.0   4.0   5.0
d   9.0  10.0  11.0
e  12.0  13.0  14.0
f  15.0  16.0  17.0

In [ ]:
# 실습 데이터 추가
df.iloc[:2, 0] = np.nan
df.iloc[:4, 1] = np.nan
print(df)

In [ ]:
# 결측값을 0 으로 대체하기
print('#4 Replace missing values')
df.fillna(0)

#4 Replace missing values

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   0.0
d   9.0  10.0  11.0   0.0
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   0.0

In [ ]:
# 딕셔너리를 활용한 컬럼별 대체값 지정하기
print('#5 Replace missing values')
replace_set = {'col2':0, 'col4':'100'}
df.fillna(replace_set)

#5 Replace missing values

   col1  col2  col3 col4
a   0.0   1.0   2.0  1.7
b   3.0   4.0   5.0  100
d   9.0  10.0  11.0  100
e  12.0  13.0  14.0  1.2
f  15.0  16.0  17.0  100

In [ ]:
print('#6 Replace missing values')
replace_set = {'col1':df['col1'].mean()}
df.fillna(replace_set, inplace=True)
df

#6 Replace missing values

   col1  col2  col3  col4
a   0.0   1.0   2.0   1.7
b   3.0   4.0   5.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   1.2
f  15.0  16.0  17.0   NaN

### 데이터 조회 : 인덱싱(indexing)

In [1]:
import pandas as pd

# 실습 데이터 생성
d = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'], 
     'score': [100, 95, 80, 85, 97], 
     'grade': ['A', 'A', 'B', 'B', 'A'], 
     'subject': ['python', 'java', 'python', 'c', 'java']}

df = pd.DataFrame(data=d)
print('Sample Data')
print(df)

Sample Data
    name  score grade subject
0  Jessi    100     A  python
1   Emma     95     A    java
2   Alex     80     B  python
3  Jessi     85     B       c
4    Tom     97     A    java

In [2]:
print('\n#1 Set Index')
df.set_index('name', inplace=True)
print(df)

#1 Set Index
       score grade subject
name
Jessi    100     A  python
Emma      95     A    java
Alex      80     B  python
Jessi     85     B       c
Tom       97     A    java

In [3]:
print('\n#2 Access rows')
subset = df.loc[['Jessi', 'Emma']]
print(subset)

#2 Access rows
       score grade subject
name
Jessi    100     A  python
Jessi     85     B       c
Emma      95     A    java

In [4]:
print('\n#3 Access rows by index position')
subset = df.iloc[[0, 4]]
print(subset)

#3 Access rows by index position
       score grade subject
name
Jessi    100     A  python
Tom       97     A    java

In [5]:
print('\n#4 Access rows by boolean indexing')
subset = df.loc[df['score'] >= 95]
print(subset)

#4 Access rows by boolean indexing
       score grade subject
name
Jessi    100     A  python
Emma      95     A    java
Tom       97     A    java

In [6]:
print('\n#5 Access rows by boolean indexing')
subset = df.loc[df['subject'] == 'python']
print(subset)

#5 Access rows by boolean indexing
       score grade subject
name
Jessi    100     A  python
Alex      80     B  python

### 데이터 조회 : 슬라이싱(slicing)

In [7]:
import pandas as pd

# 실습 데이터 생성
d = {'name': ['Jessi', 'Emma', 'Alex', 'Jessi', 'Tom'], 
     'score': [100, 95, 80, 85, 97], 
     'grade': ['A', 'A', 'B', 'B', 'A'], 
     'subject': ['python', 'java', 'python', 'c', 'java']}

sample_df = pd.DataFrame(data=d)
sample_df.set_index('name', inplace = True)

print('Sample Data')
print(sample_df)

Sample Data
       score grade subject
name
Jessi    100     A  python
Emma      95     A    java
Alex      80     B  python
Jessi     85     B       c
Tom       97     A    java

In [8]:
print('\n#1 Access Rows by slicing')
subset = sample_df[1:4]
print(subset)

#1 Access Rows by slicing
       score grade subject
name
Emma      95     A    java
Alex      80     B  python
Jessi     85     B       c

In [9]:
print('\n#2 Access Rows by slicing')
subset = sample_df[::2]
print(subset)

#2 Access Rows by slicing
       score grade subject
name
Jessi    100     A  python
Alex      80     B  python
Tom       97     A    java

In [10]:
print('\n#3 Access Rows by slicing')
subset = sample_df[:'Alex']
print(subset)

#3 Access Rows by slicing
       score grade subject
name
Jessi    100     A  python
Emma      95     A    java
Alex      80     B  python

In [11]:
print('\n#4 Access Rows by loc[slicing]')
subset = sample_df.loc[:'Emma', ['subject', 'grade']]
print(subset)

#4 Access Rows by loc[slicing]
      subject grade
name
Jessi  python     A
Emma     java     A

In [12]:
print('\n#5 Access Rows by iloc[slicing]')
subset = sample_df.iloc[:4, -1]
print(subset)

#5 Access Rows by iloc[slicing]
name
Jessi    python
Emma       java
Alex     python
Jessi         c
Name: subject, dtype: object

### Pandas의 집계함수

In [13]:
import pandas as pd
import numpy as np

# 실습 데이터 생성
score = {'sub1': [3, 9, 1, 1, 9], 
         'sub2': [2, 9, np.nan, np.nan, 8], 
         'sub3': [np.nan, 1, 5, 5, 7], 
         'sub4': [np.nan, 3, np.nan, 1, np.nan]}

df = pd.DataFrame(data=score)
print(df)

   sub1  sub2  sub3  sub4
0     3   2.0   NaN   NaN
1     9   9.0   1.0   3.0
2     1   NaN   5.0   NaN
3     1   NaN   5.0   1.0
4     9   8.0   7.0   NaN

In [14]:
print('\n#1 Count Function')
print(df.count())

#1 Count Function
sub1    5
sub2    3
sub3    4
sub4    2
dtype: int64

In [15]:
print('\n#3 Sum Function')
print(df.sum())

#3 Sum Function
sub1    23.0
sub2    19.0
sub3    18.0
sub4     4.0
dtype: float64

In [16]:
print('\n#4 Sum Function with skipna')
print(df.sum(skipna=False))

#4 Sum Function with skipna
sub1    23.0
sub2     NaN
sub3     NaN
sub4     NaN
dtype: float64